{"pageProps":{"post":{"attributes":{"title":"Let's Vibe Code","description":"Brian Holt's Complete Intro to MCP teaches you how to supercharge an AI coding agent using the Model Context Protocol (MCP), with hands-on setup for Claude Code, Cursor, Windsurf, VS Code Copilot in agent mode, and Zed. The guide also covers MCP server workflows via GitHub, Neon for databases, Playwright, Context7, Figma, and Vercel, plus practical tips on safety, ORMs like Drizzle, and keeping docs up to date.","keywords":["mcp","model context protocol","ai agents","coding agent","brian holt","ai tools","github mcp server"]},"html":"<p>Let&#39;s vibe.</p>\n<p>Which still makes me feel like I&#39;m a millennial trying to impress his zoomer nephew every time I say it. What I actually mean is let&#39;s supervise an agent writing some code for us, and let&#39;s attach some MCP servers to enhance the capabilities of our coding agent.</p>\n<p>Let me give you some options to get started here.</p>\n<ul>\n<li><a href=\"https://www.anthropic.com/claude-code\">Claude Code</a></li>\n<li><a href=\"https://cursor.com\">Cursor</a></li>\n<li><a href=\"https://windsurf.com/\">Windsurf</a></li>\n<li><a href=\"https://code.visualstudio.com/docs/copilot/chat/chat-agent-mode\">VS Code with Copilot in agent mode</a></li>\n<li><a href=\"https://zed.dev/\">Zed</a></li>\n</ul>\n<p>This list isn&#39;t exhaustive and is sure to change. The pace of innovation here is as fast as I&#39;ve ever seen it in my career. But these five work well and I know each of these can support MCP servers.</p>\n<p>Most of these aren&#39;t free either, unfortunately. You can try to connect VS Code to Ollama - <a href=\"https://marketplace.visualstudio.com/items?itemName=ms-windows-ai-studio.windows-ai-studio\">AI Toolkit</a> is a good way to try. But it&#39;ll certainly require a bit more setup and a more powerful PC to get going with.</p>\n<h2>GitHub</h2>\n<p><a href=\"https://github.com/github/github-mcp-server\">Link to the GitHub MCP setup docs</a>. Note you will need a free GitHub account.</p>\n<p>Feel free to also use the <a href=\"https://linear.app/docs/mcp\">Linear MCP server</a> here, equally as magical. You would also need a free Linear account.</p>\n<p>This MCP server is magical. It brings your whole workflow into your coding agent. You can say &quot;file a ticket to do this later and put a full description.&quot; You can then later say &quot;fetch that ticket I made before and do it.&quot; You can say &quot;take what we&#39;ve done and turn it into a pull request.&quot;</p>\n<p>You can essentially use GitHub as your coding agent&#39;s task list which more closely reflects how software devs already work. It feels so natural and lets Claude plug into your workflow as if it was just another human in the loop. I might go as far as to say this is the most impactful MCP server to me personally.</p>\n<h2>Neon</h2>\n<p><a href=\"https://neon.com/docs/ai/neon-mcp-server\">Link to the Neon MCP setup docs</a>. Note you will need a free Neon account.</p>\n<blockquote>\n<p>Note, I worked on this MCP server at Neon (which is now Databricks) so obviously I have a direct interest in showing you how to do this. Just wanted to disclose my bias here. I believe it&#39;s the best MCP server for the best Postgres service, but you can be the judge of that! Feel free to plug in any database MCP server you prefer here.</p>\n</blockquote>\n<p>This might be next in terms of impact on my workflow. This allows my agent to create and manage databases for me, see the schema, manage migrations, etc. The Neon MCP server is really cool because you can get Neon Auth through it as well, meaning you don&#39;t need another auth service.</p>\n<p>A few points of caution with databases</p>\n<ul>\n<li>Don&#39;t give an agent access to a database you can&#39;t afford to have dropped. Agents are infamous for doing things &quot;this migration isn&#39;t working. I&#39;m going to drop everything and recreate it&quot; and in the process dropping all your data.</li>\n<li>Be cautious with what other MCP servers you are using. A malicious MCP server you install alongside your database MCP server in theory could convince the agent that it needs all the data from your database at which point it could exfiltrate all that data. So be careful with sensitive data and be careful with untrusted MCP servers. That&#39;s just good advice in general.</li>\n<li>Really good idea to give the agent an ORM to work with, with <a href=\"https://orm.drizzle.team/\">Drizzle</a> being my favorite. Agents do better with TypeScript than they do with SQL, and are notoriously bad at managing migrations. If you do add an ORM, be sure to put language in there &quot;DO NOT MODIFY THE MIGRATIONS DIRECTLY, ONLY USE DRIZZLE.&quot; Then watch it ignore you and do it anyway 😂</li>\n</ul>\n<h2>Playwright</h2>\n<p><a href=\"https://github.com/microsoft/playwright-mcp\">Link to the Playwright MCP setup docs</a>. No account needed.</p>\n<p>This one is awesome because you can start getting your agent to test stuff in the browser. &quot;Hey Claude, try signing up, creating three todos, and deleting two and making sure it works at each step.&quot; Then Claude will pop up a Chrome browser and take a bunch of screenshots along the way, making sure each step works the way it&#39;s supposed to. You can even put in your initial prompt to Claude Code, &quot;make liberal use of Playwright to make sure that UI looks and acts correctly.&quot; It&#39;ll use a good amount of tokens but it will likely deliver a better product to you.</p>\n<h2>Context7</h2>\n<p><a href=\"https://github.com/upstash/context7\">Link to the Context7 MCP setup docs</a>. No account needed.</p>\n<p>I constantly find that agents will either output old/deprecated code or it will confuse new concepts with old ones. In other words, an LLM has a corpus of knowledge and with code it likely has a slightly outdated set of knowledge on the tech you want it to use. A very good example of this is Neon Auth is fairly new and sometimes if you ask a model to use Neon Auth it will either get confused or try to do something like Passport and just use Neon.</p>\n<p>This is where Context7 can be useful - it is up-to-date docs that are generated just in time for the LLM. I find I frequently need to specifically prompt the model &quot;hey, I want you to use the docs from Context7 for this service&quot; because it will generally assume it already knows and doesn&#39;t need to reach out for it. In any case, having super-up-to-date info can be very handy, particularly when you find gaps in the LLMs&#39; knowledge.</p>\n<h2>Figma</h2>\n<p><a href=\"https://www.figma.com/blog/introducing-figmas-dev-mode-mcp-server/\">Link to the Figma MCP setup docs</a>. Note you would need a paid Figma account.</p>\n<p>Unfortunately we&#39;re going to skip out on Figma this time - their free tier has zero access to their MCP server and I don&#39;t want to recommend you all spend $16+ just to try it out. However it is very cool – you just drop in your Figma design system (or use an open source one like Salesforce Lightning, Google Material, or IBM Carbon) and then let your MCP server take care of using the components. It&#39;s a very compelling dev loop, particularly if you work at a company that has a good design system already in Figma.</p>\n<h2>Vercel</h2>\n<p><a href=\"https://vercel.com/docs/mcp/vercel-mcp\">Link to the Vercel MCP setup docs</a>. Note you would need a free Vercel account if it worked.</p>\n<p>I really wanted to show you how to deploy after this using MCP but Vercel&#39;s MCP server isn&#39;t quite ready for Claude Code but it does work with Claude Desktop and VS Code with Copilot. The idea here would be you&#39;d say after you&#39;re done <code>deploy this app to Vercel</code> and voila you&#39;d have a working app out in production with no fuss. It&#39;s coming soon and it might even work by the time you take this course. They just have to fix how auth works with Claude Code.</p>\n<p>Another common thing to do is to have Claude Code write an MCP server for something that doesn&#39;t have one. Then you can have your own custom made MCP server! One word of caution: be sure to provide the <a href=\"https://modelcontextprotocol.io/llms-full.txt\">full MCP docs</a> to the agent as it will help a <em>ton</em>. I find that LLMs always get it wrong until I provide the docs in context.</p>\n<h2>Install MCPs for Claude Code</h2>\n<p>Below you will find the consolidated instructions for the MCPs used in the Claude Code lesson. For more detailed installation steps, visit the links to each tool above.</p>\n<ul>\n<li><strong>GitHub</strong><ul>\n<li><a href=\"https://github.com/github/github-mcp-server/blob/main/docs/installation-guides/install-claude.md\">Installation Instructions</a></li>\n<li><code>claude mcp add --transport http github https://api.githubcopilot.com/mcp -H &quot;Authorization: Bearer YOUR_TOKEN&quot;</code></li>\n<li>Create a <a href=\"https://github.com/settings/personal-access-tokens\">personal access token</a> for &quot;All repositories&quot; and Contents, Issues, and Pull Requests permissions</li>\n</ul>\n</li>\n<li><strong>Linear</strong><ul>\n<li><a href=\"https://linear.app/docs/mcp#claude\">Installation Instructions</a></li>\n<li><code>claude mcp add --transport sse linear-server https://mcp.linear.app/sse</code></li>\n</ul>\n</li>\n<li><strong>Neon</strong><ul>\n<li><a href=\"https://neon.com/guides/claude-code-mcp-neon\">Installation Instructions</a></li>\n<li>You&#39;ll need a Neon account to create a <a href=\"https://console.neon.tech/app/settings\">Personal API key</a></li>\n<li>When you create a new account, you may be asked to create a project</li>\n</ul>\n</li>\n<li><strong>Playwright</strong><ul>\n<li><code>claude mcp add playwright npx @playwright/mcp@latest</code></li>\n</ul>\n</li>\n<li><strong>Context7</strong><ul>\n<li><a href=\"https://github.com/upstash/context7\">Installation Instructions</a></li>\n<li>Create a Context7 account and <a href=\"https://context7.com/dashboard\">generate an API key</a></li>\n<li><code>claude mcp add --transport http context7 https://mcp.context7.com/mcp --header &quot;CONTEXT7_API_KEY: YOUR_API_KEY&quot;</code></li>\n</ul>\n</li>\n</ul>\n<p>After installing these MCPs, you can run <code>claude mcp list</code> to verify the installation.</p>\n<h2>Vibe Coding</h2>\n<p>So, at this point open Claude Code in a new directly and prompt it was something like this</p>\n<pre><code><button class=\"copy-btn\">Copy</button>I am making a Todoist clone. I want it to have the following features\n\n- Multiple users\n- Users can CRUD their todos\n- Users can mark their todos as done\n- Users cannot share todos - you can assume that a todo belongs to one person\n- Users can use tags to tag their todos. Examples would be work, personal, or fun. Users can CRUD tags. A todo can have multiple tags.\n- Users can sign, sign out, and log out.\n\nFor the tech stack, please use\n\n- Next.js and React\n- shadcn - please use shadcn as the styling method as much as possible to be consistent\n- Neon Postgres for the database\n- Neon Auth for the auth - please use Context7 to make sure you have up to date docs on Neon Auth\n- Drizzle for the ORM\n- TypeScript\n- ESLint\n- Prettier\n- Vitest for testing\n- Playwright\n- Editorconfig\n\nPlease:\n\n- include decent coverage of tests and sane linting and code formatting.\n- use Playwright MCP server to test that UI is styled correctly and interactions work as planned\n- use Context7 liberally to make sure you have the latest docs for various libraries.\n- prepare this to be hosted on GitHub. Maintain a useful README for documentation, and mark the project as being Apache 2.0.\n- prepare this to be deployed to Vercel afterwards.\n- use Neon branching liberally if you need to migrate or test migrations\n- DO NOT WRITE OR MODIFY MIGRATIONS YOURSELF. ONLY USE DRIZZLE FOR MIGRATIONS.\n</code></pre><p>This isn&#39;t necessarily the best prompt but it&#39;s a pretty good one to get started with. This is a huge chunk of work for Claude to start working on but I&#39;ve found Claude Code to be up to the task. When I&#39;m working with Cursor, Windsurf, or VS Code w/ Copilot, I generally have a different LLM (usually Claude) generate a task list first and then I have the LLMs follow the task list and mark off their tasks one-by-one. In any case, this will get you started pretty well. I was able to &quot;one-shot&quot; (meaning it worked the first time) the Todoist app with this.</p>\n<p>I&#39;ll then usually prompt it to try a few flows with Playwright.</p>\n<p>Then I&#39;ll add a prompt to push this to GitHub. If I have any future features I want to add, I&#39;ll prompt Claude Code to add new tasks for that e.g. &quot;add a GitHub issue to add dark mode. Please include a brief checklist on what needs to be done to make dark mode work&quot;.</p>\n<p>At this point, you could install the Vercel CLI, log in, and say &quot;please deploy this to Vercel&quot; and usually it&#39;ll do pretty well at that too.</p>\n<p>That&#39;s really it! That&#39;s vibe coding!</p>\n","markdown":"\nLet's vibe.\n\nWhich still makes me feel like I'm a millennial trying to impress his zoomer nephew every time I say it. What I actually mean is let's supervise an agent writing some code for us, and let's attach some MCP servers to enhance the capabilities of our coding agent.\n\nLet me give you some options to get started here.\n\n- [Claude Code][claude]\n- [Cursor][cursor]\n- [Windsurf][windsurf]\n- [VS Code with Copilot in agent mode][vscode]\n- [Zed][zed]\n\nThis list isn't exhaustive and is sure to change. The pace of innovation here is as fast as I've ever seen it in my career. But these five work well and I know each of these can support MCP servers.\n\nMost of these aren't free either, unfortunately. You can try to connect VS Code to Ollama - [AI Toolkit][toolkit] is a good way to try. But it'll certainly require a bit more setup and a more powerful PC to get going with.\n\n## GitHub\n\n[Link to the GitHub MCP setup docs][github]. Note you will need a free GitHub account.\n\nFeel free to also use the [Linear MCP server][linear] here, equally as magical. You would also need a free Linear account.\n\nThis MCP server is magical. It brings your whole workflow into your coding agent. You can say \"file a ticket to do this later and put a full description.\" You can then later say \"fetch that ticket I made before and do it.\" You can say \"take what we've done and turn it into a pull request.\"\n\nYou can essentially use GitHub as your coding agent's task list which more closely reflects how software devs already work. It feels so natural and lets Claude plug into your workflow as if it was just another human in the loop. I might go as far as to say this is the most impactful MCP server to me personally.\n\n## Neon\n\n[Link to the Neon MCP setup docs][neon]. Note you will need a free Neon account.\n\n> Note, I worked on this MCP server at Neon (which is now Databricks) so obviously I have a direct interest in showing you how to do this. Just wanted to disclose my bias here. I believe it's the best MCP server for the best Postgres service, but you can be the judge of that! Feel free to plug in any database MCP server you prefer here.\n\nThis might be next in terms of impact on my workflow. This allows my agent to create and manage databases for me, see the schema, manage migrations, etc. The Neon MCP server is really cool because you can get Neon Auth through it as well, meaning you don't need another auth service.\n\nA few points of caution with databases\n\n- Don't give an agent access to a database you can't afford to have dropped. Agents are infamous for doing things \"this migration isn't working. I'm going to drop everything and recreate it\" and in the process dropping all your data.\n- Be cautious with what other MCP servers you are using. A malicious MCP server you install alongside your database MCP server in theory could convince the agent that it needs all the data from your database at which point it could exfiltrate all that data. So be careful with sensitive data and be careful with untrusted MCP servers. That's just good advice in general.\n- Really good idea to give the agent an ORM to work with, with [Drizzle][drizzle] being my favorite. Agents do better with TypeScript than they do with SQL, and are notoriously bad at managing migrations. If you do add an ORM, be sure to put language in there \"DO NOT MODIFY THE MIGRATIONS DIRECTLY, ONLY USE DRIZZLE.\" Then watch it ignore you and do it anyway 😂\n\n## Playwright\n\n[Link to the Playwright MCP setup docs][playwright]. No account needed.\n\nThis one is awesome because you can start getting your agent to test stuff in the browser. \"Hey Claude, try signing up, creating three todos, and deleting two and making sure it works at each step.\" Then Claude will pop up a Chrome browser and take a bunch of screenshots along the way, making sure each step works the way it's supposed to. You can even put in your initial prompt to Claude Code, \"make liberal use of Playwright to make sure that UI looks and acts correctly.\" It'll use a good amount of tokens but it will likely deliver a better product to you.\n\n## Context7\n\n[Link to the Context7 MCP setup docs][context7]. No account needed.\n\nI constantly find that agents will either output old/deprecated code or it will confuse new concepts with old ones. In other words, an LLM has a corpus of knowledge and with code it likely has a slightly outdated set of knowledge on the tech you want it to use. A very good example of this is Neon Auth is fairly new and sometimes if you ask a model to use Neon Auth it will either get confused or try to do something like Passport and just use Neon.\n\nThis is where Context7 can be useful - it is up-to-date docs that are generated just in time for the LLM. I find I frequently need to specifically prompt the model \"hey, I want you to use the docs from Context7 for this service\" because it will generally assume it already knows and doesn't need to reach out for it. In any case, having super-up-to-date info can be very handy, particularly when you find gaps in the LLMs' knowledge.\n\n## Figma\n\n[Link to the Figma MCP setup docs][figma]. Note you would need a paid Figma account.\n\nUnfortunately we're going to skip out on Figma this time - their free tier has zero access to their MCP server and I don't want to recommend you all spend $16+ just to try it out. However it is very cool – you just drop in your Figma design system (or use an open source one like Salesforce Lightning, Google Material, or IBM Carbon) and then let your MCP server take care of using the components. It's a very compelling dev loop, particularly if you work at a company that has a good design system already in Figma.\n\n## Vercel\n\n[Link to the Vercel MCP setup docs][vercel]. Note you would need a free Vercel account if it worked.\n\nI really wanted to show you how to deploy after this using MCP but Vercel's MCP server isn't quite ready for Claude Code but it does work with Claude Desktop and VS Code with Copilot. The idea here would be you'd say after you're done `deploy this app to Vercel` and voila you'd have a working app out in production with no fuss. It's coming soon and it might even work by the time you take this course. They just have to fix how auth works with Claude Code.\n\nAnother common thing to do is to have Claude Code write an MCP server for something that doesn't have one. Then you can have your own custom made MCP server! One word of caution: be sure to provide the [full MCP docs][mcp] to the agent as it will help a _ton_. I find that LLMs always get it wrong until I provide the docs in context.\n\n## Install MCPs for Claude Code\n\nBelow you will find the consolidated instructions for the MCPs used in the Claude Code lesson. For more detailed installation steps, visit the links to each tool above.\n\n- **GitHub**\n  - [Installation Instructions](https://github.com/github/github-mcp-server/blob/main/docs/installation-guides/install-claude.md)\n  - `claude mcp add --transport http github https://api.githubcopilot.com/mcp -H \"Authorization: Bearer YOUR_TOKEN\"`\n  - Create a [personal access token](https://github.com/settings/personal-access-tokens) for \"All repositories\" and Contents, Issues, and Pull Requests permissions\n- **Linear**\n  - [Installation Instructions](https://linear.app/docs/mcp#claude)\n  - `claude mcp add --transport sse linear-server https://mcp.linear.app/sse`\n- **Neon**\n  - [Installation Instructions](https://neon.com/guides/claude-code-mcp-neon)\n  - You'll need a Neon account to create a [Personal API key](https://console.neon.tech/app/settings)\n  - When you create a new account, you may be asked to create a project\n- **Playwright**\n  - `claude mcp add playwright npx @playwright/mcp@latest`\n- **Context7**\n  - [Installation Instructions](https://github.com/upstash/context7)\n  - Create a Context7 account and [generate an API key](https://context7.com/dashboard)\n  - `claude mcp add --transport http context7 https://mcp.context7.com/mcp --header \"CONTEXT7_API_KEY: YOUR_API_KEY\"`\n\nAfter installing these MCPs, you can run `claude mcp list` to verify the installation.\n\n## Vibe Coding\n\nSo, at this point open Claude Code in a new directly and prompt it was something like this\n\n```\nI am making a Todoist clone. I want it to have the following features\n\n- Multiple users\n- Users can CRUD their todos\n- Users can mark their todos as done\n- Users cannot share todos - you can assume that a todo belongs to one person\n- Users can use tags to tag their todos. Examples would be work, personal, or fun. Users can CRUD tags. A todo can have multiple tags.\n- Users can sign, sign out, and log out.\n\nFor the tech stack, please use\n\n- Next.js and React\n- shadcn - please use shadcn as the styling method as much as possible to be consistent\n- Neon Postgres for the database\n- Neon Auth for the auth - please use Context7 to make sure you have up to date docs on Neon Auth\n- Drizzle for the ORM\n- TypeScript\n- ESLint\n- Prettier\n- Vitest for testing\n- Playwright\n- Editorconfig\n\nPlease:\n\n- include decent coverage of tests and sane linting and code formatting.\n- use Playwright MCP server to test that UI is styled correctly and interactions work as planned\n- use Context7 liberally to make sure you have the latest docs for various libraries.\n- prepare this to be hosted on GitHub. Maintain a useful README for documentation, and mark the project as being Apache 2.0.\n- prepare this to be deployed to Vercel afterwards.\n- use Neon branching liberally if you need to migrate or test migrations\n- DO NOT WRITE OR MODIFY MIGRATIONS YOURSELF. ONLY USE DRIZZLE FOR MIGRATIONS.\n```\n\nThis isn't necessarily the best prompt but it's a pretty good one to get started with. This is a huge chunk of work for Claude to start working on but I've found Claude Code to be up to the task. When I'm working with Cursor, Windsurf, or VS Code w/ Copilot, I generally have a different LLM (usually Claude) generate a task list first and then I have the LLMs follow the task list and mark off their tasks one-by-one. In any case, this will get you started pretty well. I was able to \"one-shot\" (meaning it worked the first time) the Todoist app with this.\n\nI'll then usually prompt it to try a few flows with Playwright.\n\nThen I'll add a prompt to push this to GitHub. If I have any future features I want to add, I'll prompt Claude Code to add new tasks for that e.g. \"add a GitHub issue to add dark mode. Please include a brief checklist on what needs to be done to make dark mode work\".\n\nAt this point, you could install the Vercel CLI, log in, and say \"please deploy this to Vercel\" and usually it'll do pretty well at that too.\n\nThat's really it! That's vibe coding!\n\n[toolkit]: https://marketplace.visualstudio.com/items?itemName=ms-windows-ai-studio.windows-ai-studio\n[zed]: https://zed.dev/\n[vscode]: https://code.visualstudio.com/docs/copilot/chat/chat-agent-mode\n[windsurf]: https://windsurf.com/\n[claude]: https://www.anthropic.com/claude-code\n[cursor]: https://cursor.com\n[figma]: https://www.figma.com/blog/introducing-figmas-dev-mode-mcp-server/\n[mcp]: https://modelcontextprotocol.io/llms-full.txt\n[github]: https://github.com/github/github-mcp-server\n[neon]: https://neon.com/docs/ai/neon-mcp-server\n[playwright]: https://github.com/microsoft/playwright-mcp\n[context7]: https://github.com/upstash/context7\n[vercel]: https://vercel.com/docs/mcp/vercel-mcp\n[linear]: https://linear.app/docs/mcp\n[drizzle]: https://orm.drizzle.team/\n","slug":"lets-vibe-code","title":"Let's Vibe Code","section":"Vibes","icon":"hand-sparkles","filePath":"/home/runner/work/complete-intro-to-mcp/complete-intro-to-mcp/lessons/07-vibes/A-lets-vibe-code.md","nextSlug":"/lessons/vibes/security","prevSlug":"/lessons/sses-and-streaming-html/streamable-http"}},"__N_SSG":true}